// tailwind.config.js
module.exports = {
  purge: ['./index.html', './src/**/*.{vue,js,ts,jsx,tsx}'],

  /*
  false — вимикає підтримку темної теми. 
  Якщо ви використовуєте це, ваш проект не буде підтримувати автоматичний перехід на темну тему.

  'media' — активує темну тему на основі налаштувань системи користувача (зазвичай, якщо у користувача увімкнена темна тема на системному рівні, сайт автоматично змінює тему на темну).

  'class' — активує темну тему, якщо ви додаєте клас dark до кореневого елемента (наприклад, <html class="dark">). Це дає більше контролю, оскільки ви можете змінювати тему вручну, додаючи або видаляючи цей клас.
  */
  darkMode: class, // false  or 'media' or 'class'


  theme: {
    extend: {},
  },
  variants: {
    extend: {},
  },
  plugins: [],
}
